app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("description", "todo_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "The first item"], ["todo_list_id", 1], ["created_at", "2020-07-29 12:30:04.501268"], ["updated_at", "2020-07-29 12:30:04.501268"]]
---
  def create
    @todo_item = @todo_list.todo_items.build(todo_item_params)

    if @todo_item.save

UPDATE "todo_items" SET "completed" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed", 0], ["updated_at", "2020-07-29 10:51:58.461830"], ["id", 1]]
---
  def update
    if @todo_item.update_attributes(todo_item_params)